templates/work_journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Journal</title>
<!-- 2015-09-16 Wed 09:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="/css/solarized-dark.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Journal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-16 Wed&gt;</span></span></a></li>
<li><a href="#sec-2">2. <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-15 Tue&gt;</span></span></a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-16 Wed&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Fixed Pip.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Turns out it was a package manager fight. Once I unemerged pip and
reinstalled it using the manual installer, it worked just fine.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Had issues installing different pips. Fixed it.<br  /></li></ol>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installed and played with Camxes.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
It's a really easy tool.
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Kunal got back to me</h3>
<div class="outline-text-3" id="text-1-3">
</div><ol class="org-ol"><li><a id="sec-1-3-1" name="sec-1-3-1"></a><span class="todo TODO">TODO</span> Look into IRSLTM<br  /><div class="outline-text-4" id="text-1-3-1">
<p>
This is a modeling toolkit by Marcello Federico at FBK and University of Trento in Italy
</p>
</div>
</li>
<li><a id="sec-1-3-2" name="sec-1-3-2"></a><span class="todo TODO">TODO</span> Look into Berkley POS (Parts of Speech) Tagger<br  /></li>
<li><a id="sec-1-3-3" name="sec-1-3-3"></a><span class="todo TODO">TODO</span> Look into Tree Tagger<br  /></li>
<li><a id="sec-1-3-4" name="sec-1-3-4"></a><span class="todo TODO">TODO</span> Look into shef.mt.tools Java package<br  /></li>
<li><a id="sec-1-3-5" name="sec-1-3-5"></a><span class="todo TODO">TODO</span> Go through MT work done by RWTH Aachen<br  /><div class="outline-text-4" id="text-1-3-5">
<p>
Good enough for a jumping point in learning MT
</p>
</div>
</li>
<li><a id="sec-1-3-6" name="sec-1-3-6"></a><span class="todo TODO">TODO</span> Also look at previous work done by AppTek, prior to eBay acquisition<br  /><div class="outline-text-4" id="text-1-3-6">
<p>
They specialized in Automated Speech Recognition (ASR) and Machine Translation (MT)
</p>
</div>
</li>
<li><a id="sec-1-3-7" name="sec-1-3-7"></a><span class="todo TODO">TODO</span> Linguistics Textbook: Find Jurafsky and Martin<br  /></li></ol>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Emailed Riley, asked him for more resources</h3>
<div class="outline-text-3" id="text-1-4">
<p>
He saw it. What next&#x2026;
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Adventures in Github</h3>
<div class="outline-text-3" id="text-1-5">
</div><ol class="org-ol"><li><a id="sec-1-5-1" name="sec-1-5-1"></a><a href="https://github.com/leeavital/Lojban-Translator">Lojban-Translator</a><br  /><div class="outline-text-4" id="text-1-5-1">
<p>
It feels like a school project. Tried their examples and one throws an exception.
Namely, "do blari'o" is supposed to be "you're blue"
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-15 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Had a meeting with Kauffman at 9 am.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Work hard, work smart, honor the time commitments.
Got a list of things to get done.
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-1-1" name="sec-2-1-1"></a><span class="todo TODO">TODO</span> Send Preliminary Results by <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-21 Mon&gt;</span></span><br  /></li>
<li><a id="sec-2-1-2" name="sec-2-1-2"></a><span class="todo TODO">TODO</span> Translate "The duck is ready to eat" into two lojban sentences.<br  /></li>
<li><a id="sec-2-1-3" name="sec-2-1-3"></a><span class="todo TODO">TODO</span> Produce an overview of the grammar<br  /></li>
<li><a id="sec-2-1-4" name="sec-2-1-4"></a><span class="todo TODO">TODO</span> Produce list of tools with quality evals<br  /><div class="outline-text-4" id="text-2-1-4">
<blockquote>
<p>
"Dictionaries are useful.<br  />
Parsers are more useful.<br  />
Does a Lojban to English translator exist?"
</p>
</blockquote>
</div>
</li>
<li><a id="sec-2-1-5" name="sec-2-1-5"></a><span class="todo TODO">TODO</span> Get NLP/MT background resource<br  /></li>
<li><a id="sec-2-1-6" name="sec-2-1-6"></a><span class="todo TODO">TODO</span> Check out NLTK. See if it's good for Lojban (or too English-centric)<br  /></li>
<li><a id="sec-2-1-7" name="sec-2-1-7"></a><span class="todo TODO">TODO</span> Meet with him at 9:30, <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-25 Fri&gt;</span></span>, preparing the above as demonstration<br  /></li></ol>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Libraries are good places not to get distracted</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-09-16 Wed 09:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
